Rails/first_route/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Henry"], ["email", "henry@gmail.com"], ["created_at", "2020-10-27 10:45:59.674513"], ["updated_at", "2020-10-27 10:45:59.674513"]]
---
  def create
    user = User.new(self.user_params)
    if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Abraham"], ["email", "abraham@gmail.com"], ["updated_at", "2020-10-27 11:09:45.479125"], ["id", 9]]
---
  def update
    user = User.find_by(id: params[:id])
    if !user.nil?
      user.update!(self.user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 9]]
---
  def destroy
    user= User.find_by(id: params[:id])
    if !user.nil?
      user.destroy