Rails/art_work/app/controllers/artworks_controller.rb

  def index
    user = User.find_by(id: params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def update
    artwork = Artwork.find(params[:id])
    if artwork.update_attributes(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "artworks" SET "image_url" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["image_url", "images/some.jpg"], ["updated_at", "2020-10-27 14:11:21.021401"], ["id", 4]]