Rails/art_work/app/controllers/comments_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
---
  def index
    if !params[:user_id].nil?
      user = User.find_by(id: params[:user_id])
      if !user.nil?
        render json: user.comments
      end
    end

    if !params[:artwork_id].nil?
      artwork = Artwork.find_by(id: params[:artwork_id])

SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 16]]
---
  def destroy
    comment = Comment.find(params[:id])