Rails/art_work/app/controllers/likes_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]
---
  def index
    begin
      user = User.find(params[:user_id])

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]
---
  def art_liked_by
    begin
      artwork = Artwork.find(params[:id])

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
---
  def comment_liked_by
    begin
      comment = Comment.find(params[:id])