Rails/art_work/app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at", "username") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2020-10-27 13:41:15.853842"], ["updated_at", "2020-10-27 13:41:15.853842"], ["username", "Biruk"]]
---
  def create
    user = User.new(user_params)
    if user.save

SELECT "users".* FROM "users" WHERE (UPPER(users.username) LIKE UPPER('%L%u%c%a%s%'))
---
  def show
    render json: User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "Chala"], ["updated_at", "2020-10-27 13:41:37.244136"], ["id", 4]]
---
  def update
    user = User.find(params[:id])
    if user.update_attributes(user_params)