SQL/Active_Record/URLShortener/app/models/shorthened_url.rb

  def nonpremium_max
    if !User.find(user_id).premium && ShorthenedUrl.where(["user_id = ?", user_id]).count >= 5
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def self.random_code
    begin
      generated_short_url = SecureRandom.urlsafe_base64
      if ShorthenedUrl.exists?(:short_url => generated_short_url)
---
SELECT  1 AS one FROM "shorthened_urls" WHERE "shorthened_urls"."short_url" = $1 LIMIT $2  [["short_url", "p3bETMmEe1lzznZaD2RG1Q"], ["LIMIT", 1]]