SQL/Active_Record/URLShortener/app/models/visit.rb

  def self.record_visit!(user, shorthened_url)
    Visit.create!(
      user_id: user.id,
      shorthened_url_id: shorthened_url.id
    )
---
INSERT INTO "visits" ("user_id", "shorthened_url_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["shorthened_url_id", 5], ["created_at", "2020-10-09 12:36:12.463177"], ["updated_at", "2020-10-09 12:36:12.463177"]]