Rails/cats99/app/models/cat_rental_request.rb

SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1 AND (start_date = '2020-11-09' OR start_date = '2020-11-10' OR start_date BETWEEN '2020-11-09' AND '2020-11-10') AND "cat_rental_requests"."status" = $2  [["cat_id", 2], ["status", "PENDING"]]
---
  def overlapping_pending_requests
    self.overlapping_requests.where(status: 'PENDING')

UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "APPROVED"], ["updated_at", "2020-11-08 11:27:20.280677"], ["id", 1]]
UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "DENIED"], ["updated_at", "2020-11-08 11:42:30.020382"], ["id", 9]]
---
  def approve!
    self.status = "APPROVED"
    self.save!
    # When making several related updates to the DB,
    # group them in a transaction
    CatRentalRequest.transaction do
      self.overlapping_pending_requests.each do |request|
        request.status = "DENIED"
        request.save!

UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "DENIED"], ["updated_at", "2020-11-08 11:26:25.712901"], ["id", 5]]
---
  def deny!
    self.status = "DENIED"
    self.save!