Rails/cats99/app/controllers/cat_rental_requests_controller.rb

  def create
    @cat_rental_request = CatRentalRequest.new(cat_rental_request_params)

    if @cat_rental_request.save
---
INSERT INTO "cat_rental_requests" ("cat_id", "start_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cat_id", 2], ["start_date", "2020-11-09"], ["end_date", "2020-11-10"], ["created_at", "2020-11-08 09:54:12.371959"], ["updated_at", "2020-11-08 09:54:12.371959"]]