Rails/cats99/app/controllers/cat_rental_requests_controller.rb

  def new
    @all_cats= Cat.all.select(:name, :id)
---
SELECT "cats"."name", "cats"."id" FROM "cats"

  def approve
    @request = CatRentalRequest.find_by(id: params[:id])
---
SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def deny
    @request = CatRentalRequest.find_by(id: params[:id])
---
SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def create
    @cat_rental_request = CatRentalRequest.new(cat_rental_request_params)

    if @cat_rental_request.save
      redirect_to cat_url(@cat_rental_request.requested_cat)
    else
      @all_cats= Cat.all.select(:name, :id)
---
INSERT INTO "cat_rental_requests" ("cat_id", "start_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cat_id", 3], ["start_date", "2020-11-09"], ["end_date", "2020-11-10"], ["created_at", "2020-11-08 11:31:55.651995"], ["updated_at", "2020-11-08 11:31:55.651995"]]
SELECT "cats"."name", "cats"."id" FROM "cats"