Rails/cats99/app/controllers/cats_controller.rb

  def show
    @cat = Cat.find_by(id: params[:id])
    @requests = @cat.rental_request.order(:start_date)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1 ORDER BY "cat_rental_requests"."start_date" ASC  [["cat_id", 2]]

  def update
    @cat = Cat.find_by(id: params[:id])

    if @cat.update_attributes(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "sex" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["sex", "M"], ["description", "    A nice cat with sleepy head\r\n  "], ["updated_at", "2020-11-06 12:51:17.972069"], ["id", 1]]